{
  "base_model_name_or_path": "/data/wpd/model",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "lora_alpha": 16,
  "lora_dropout": 0.05,
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 8,
  "target_modules": [
    "attn.c_proj",
    "attn.c_attn"
  ],
  "task_type": "CAUSAL_LM"
}